In [47]:
import pandas as pd
import numpy as np
import datetime as dt

In [28]:
file = "/Users/mini/d3js_projects/project02-nba-scoring/2018_19_game_pts_data.csv"
df = pd.read_csv(file)

In [29]:
df.head()

   Unnamed: 0               team_name        date  points
0           0   Golden State Warriors  2018-10-16     108
1           1   Oklahoma City Thunder  2018-10-16     100
2           2      Philadelphia 76ers  2018-10-16      87
3           3          Boston Celtics  2018-10-16     105
4           4  Minnesota Timberwolves  2018-10-17     108

In [30]:
df_celts = df[df.team_name == "Boston Celtics"]
df_celts.head()

     Unnamed: 0       team_name        date  points
3             3  Boston Celtics  2018-10-16     105
44           44  Boston Celtics  2018-10-19     101
56           56  Boston Celtics  2018-10-20     103
83           83  Boston Celtics  2018-10-22      90
131         131  Boston Celtics  2018-10-25     101

In [31]:
celts_filename = "2018_19_celtics_pts_data.csv"
df_celts.to_csv(celts_filename)

In [32]:
df.team_name.unique()

array(['Golden State Warriors', 'Oklahoma City Thunder',
       'Philadelphia 76ers', 'Boston Celtics', 'Minnesota Timberwolves',
       'San Antonio Spurs', 'Atlanta Hawks', 'New York Knicks',
       'Phoenix Suns', 'Dallas Mavericks', 'New Orleans Pelicans',
       'Houston Rockets', 'Miami Heat', 'Orlando Magic', 'Denver Nuggets',
       'LA Clippers', 'Brooklyn Nets', 'Detroit Pistons',
       'Indiana Pacers', 'Memphis Grizzlies', 'Sacramento Kings',
       'Utah Jazz', 'Milwaukee Bucks', 'Charlotte Hornets',
       'Toronto Raptors', 'Cleveland Cavaliers', 'Chicago Bulls',
       'Portland Trail Blazers', 'Los Angeles Lakers',
       'Washington Wizards'], dtype=object)

In [33]:
df_celts.dtypes

Unnamed: 0     int64
team_name     object
date          object
points         int64
dtype: object

In [35]:
df_celts.drop("Unnamed: 0" , axis=1, inplace = True)

/anaconda3/lib/python3.6/site-packages/pandas/core/frame.py:4097: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  errors=errors,

In [66]:
df_celts.date = pd.to_datetime(df_celts.date)

/anaconda3/lib/python3.6/site-packages/pandas/core/generic.py:5209: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  self[name] = value

In [85]:
df_celts.points.std()

10.574551442561622

In [59]:
pd.to_datetime(df_celts.date.iloc[0]).month

10

In [92]:
df_celts_monthly_stds = df_celts.resample('M').std().reset_index()

In [93]:
df_celts_monthly_means = df_celts.resample('M').mean().reset_index()

In [94]:
df_celts_monthly_means

        date      points
0 2018-10-31  102.428571
1 2018-11-30  110.733333
2 2018-12-31  117.214286
3 2019-01-31  114.333333
4 2019-02-28  110.909091
5 2019-03-31  113.266667
6 2019-04-30  112.600000

In [101]:
df_celts_monthly_stds['mean_pts'] = df_celts_monthly_means.points

In [102]:
df_celts_monthly_stds

        date     points    mean_pts
0 2018-10-31   6.320790  102.428571
1 2018-11-30  11.247010  110.733333
2 2018-12-31   9.877547  117.214286
3 2019-01-31   9.618930  114.333333
4 2019-02-28  13.322571  110.909091
5 2019-03-31  10.333487  113.266667
6 2019-04-30   3.847077  112.600000

In [104]:
df_celts_monthly_summaries = df_celts_monthly_stds.copy()
df_celts_monthly_summaries.rename(columns = {'points': 'std_pts'}, inplace=True)

In [105]:
df_celts_monthly_summaries

        date    std_pts    mean_pts
0 2018-10-31   6.320790  102.428571
1 2018-11-30  11.247010  110.733333
2 2018-12-31   9.877547  117.214286
3 2019-01-31   9.618930  114.333333
4 2019-02-28  13.322571  110.909091
5 2019-03-31  10.333487  113.266667
6 2019-04-30   3.847077  112.600000

In [106]:
celts_summaries_filename = "2018-19_celts_monthly_summary_data.csv"
df_celts_monthly_summaries.to_csv(celts_summaries_filename)